{
  "openings": {
    "Sicilian Defense": {
      "description": "Black immediately challenges White's center control with a flank pawn, creating an asymmetrical position with dynamic counterplay.",
      "variations": {
        "Accelerated Dragon": "Black fianchettoes the king's bishop quickly for rapid development and kingside safety.",
        "Accelerated Dragon, Exchange Variation": "White exchanges knights to simplify the position and undermine Black's fianchetto structure.",
        "Accelerated Dragon, Maróczy Bind": "White establishes a space-gaining pawn structure that restricts Black's piece mobility.",
        "Alapin Variation": "White plays c3 to support a d4 advance, creating a more positional game.",
        "Classical Variation": "Black develops naturally with a solid central pawn structure.",
        "Dragon Variation": "Black fianchettoes the king's bishop and prepares for opposite-side castling with aggressive counterplay.",
        "Najdorf Variation": "Black prepares queenside counterplay with a6, creating a flexible position with multiple plans.",
        "Scheveningen Variation": "Black forms a compact, defensive structure with pawns on e6 and d6."
      }
    },
    "Italian Game": {
      "description": "White develops the bishop to its most active diagonal, targeting Black's vulnerable f7 square while preparing for kingside castling.",
      "variations": {
        "Giuoco Piano": "A slow, strategic opening where both sides develop methodically with balanced positions.",
        "Evans Gambit": "White sacrifices a pawn with b4 to accelerate development and gain attacking chances.",
        "Two Knights Defense": "Black responds with Nf6, prioritizing piece development over pawn structure.",
        "Hungarian Defense": "Black develops the bishop to e7 rather than c5, creating a more solid but less active position."
      }
    },
    "Caro-Kann Defense": {
      "description": "Black responds to e4 with a solid pawn structure that supports gradual piece development. Offers fewer immediate tactical opportunities but greater structural integrity.",
      "variations": {
        "Advance Variation": "White pushes e5 to gain space and constrict Black's position.",
        "Classical Variation": "White develops naturally with Nc3 and aims for a central pawn majority.",
        "Exchange Variation": "White simplifies the position by trading pawns in the center, aiming for a slight endgame advantage.",
        "Panov Attack": "White creates a central pawn majority and aims for an IQP (Isolated Queen's Pawn) position with active piece play."
      }
    },
    "French Defense": {
      "description": "Black establishes a solid pawn chain but temporarily restricts the king's bishop. Leads to asymmetrical positions with clear strategic plans for both sides.",
      "variations": {
        "Advance Variation": "White gains space with e5, creating a closed position where piece maneuvers are crucial.",
        "Classical Variation": "White develops naturally, maintaining tension in the center.",
        "Exchange Variation": "White simplifies the position by trading central pawns, leading to a more open game.",
        "Tarrasch Variation": "White develops the queen's knight to d2, avoiding the pin that can occur in the Classical Variation.",
        "Winawer Variation": "Black pins the knight with Bb4, creating immediate tension and forcing White to make a structural decision."
      }
    },
    "Scandinavian Defense": {
      "description": "Black immediately challenges White's e4 pawn, forcing an early queen exchange or queen movement. Creates unbalanced positions with clear tactical themes.",
      "variations": {
        "Modern Variation": "Black recaptures with the queen and typically retreats to d6, planning quick development.",
        "Classical Variation": "Black retreats the queen to a5, applying pressure on c3 and preparing queenside development."
      }
    },
    "Scotch Game": {
      "description": "White immediately opens the center with d4, exchanging pawns to accelerate piece development and create open lines.",
      "variations": {
        "Classical Variation": "Black responds by developing the bishop to c5, maintaining pressure in the center.",
        "Schmidt Variation": "Black develops with Nf6, introducing more complexity into the position.",
        "Göring Gambit": "White sacrifices a pawn with c3 and exd4, gaining tempo and open lines for attack."
      }
    },
    "Ruy Lopez": {
      "description": "White develops the bishop to apply pressure on Black's knight, potentially weakening the pawn structure. Creates complex positions with long-term strategic themes.",
      "variations": {
        "Berlin Defense": "Black responds with Nf6, preparing for a solid defensive structure.",
        "Closed Variation": "Features a complex middlegame after Black plays a6, d6, and maintains the central tension.",
        "Exchange Variation": "White simplifies by trading the bishop for the knight, damaging Black's pawn structure.",
        "Marshall Attack": "Black sacrifices a pawn for long-term attacking chances against White's king.",
        "Open Variation": "Arises when Black captures White's e-pawn, leading to more tactical positions."
      }
    },
    "Queen's Gambit": {
      "description": "White offers a pawn to control the center, gaining spatial advantage and better piece development.",
      "variations": {
        "Accepted": "Black takes the offered pawn, allowing White central dominance but hoping for counterplay.",
        "Declined": "Black supports the d5 pawn with e6, maintaining a solid center but restricting the king's bishop.",
        "Slav Defense": "Black supports d5 with c6, avoiding the light-squared bishop's development problems.",
        "Semi-Slav": "Combines elements of both the QGD and Slav, with pawns on e6 and c6, creating a solid but temporarily passive position."
      }
    },
    "English Opening": {
      "description": "White starts with c4, controlling the d5 square while maintaining flexibility for various pawn structures.",
      "variations": {
        "Symmetrical": "Black mirrors with c5, creating balanced positions with mutual chances.",
        "Reversed Sicilian": "White plays like a Sicilian Defense with an extra tempo, often after e4 setups.",
        "Four Knights": "Both players develop knights to natural squares, creating a balanced, maneuvering game.",
        "Botvinnik System": "White sets up a powerful pawn center with e4 and d4 after early development."
      }
    },
    "King's Indian Defense": {
      "description": "Black allows White to establish a broad pawn center, then challenges it with piece pressure and timely pawn breaks.",
      "variations": {
        "Classical Variation": "White builds a strong pawn center and develops pieces to their optimal squares.",
        "Sämisch Variation": "White plays f3, preparing for a kingside pawn advance and restricting Black's piece activity.",
        "Four Pawns Attack": "White aggressively advances all central pawns, seeking maximum space advantage.",
        "Fianchetto Variation": "White develops the king's bishop via fianchetto, creating a more positional game."
      }
    },
    "Nimzo-Indian Defense": {
      "description": "Black pins White's knight with Bb4, creating pressure that may lead to doubled pawns or piece concessions.",
      "variations": {
        "Classical Variation": "White accepts doubled pawns after Bxc3, but gains the bishop pair and open lines.",
        "Rubinstein Variation": "White plays e3 and Bd3, prioritizing development over structural concerns.",
        "Kasparov Variation": "Features an early a3, forcing Black to declare intentions with the bishop.",
        "Leningrad Variation": "White plays an early f3, supporting e4 and preventing Black from playing Ne4."
      }
    }
  }
} 